george-hopkins/hcs12mem/target/io_mc9s12.h
/*
   hc12mem - HC12 memory reader & writer
   io_mc9s12.h: MC9S12 generic I/O registers
   $Id$

   Copyright (C) 2005 Michal Konieczny <mk@cml.mfk.net.pl>

   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions
   are met:
   1. Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
   2. Redistributions in binary form must reproduce the above copyright
      notice, this list of conditions and the following disclaimer in the
      documentation and/or other materials provided with the distribution.
   3. Neither the name of the project nor the names of its contributors
      may be used to endorse or promote products derived from this software
      without specific prior written permission.

   THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND
   ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED.  IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE
   FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
   DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
   OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
   HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
   LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
   OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
   SUCH DAMAGE.
*/

#ifndef __IO_MC9S12_H
#define __IO_MC9S12_H

/* MEBI map 1 of 3 */

#define PORTA 0x0000
#  define PORTA_BIT7 0x80
#  define PORTA_BIT6 0x40
#  define PORTA_BIT5 0x20
#  define PORTA_BIT4 0x10
#  define PORTA_BIT3 0x08
#  define PORTA_BIT2 0x04
#  define PORTA_BIT1 0x02
#  define PORTA_BIT0 0x01
#define PORTB 0x0001
#  define PORTB_BIT7 0x80
#  define PORTB_BIT6 0x40
#  define PORTB_BIT5 0x20
#  define PORTB_BIT4 0x10
#  define PORTB_BIT3 0x08
#  define PORTB_BIT2 0x04
#  define PORTB_BIT1 0x02
#  define PORTB_BIT0 0x01
#define DDRA  0x0002
#  define DDRA_BIT7 0x80
#  define DDRA_BIT6 0x40
#  define DDRA_BIT5 0x20
#  define DDRA_BIT4 0x10
#  define DDRA_BIT3 0x08
#  define DDRA_BIT2 0x04
#  define DDRA_BIT1 0x02
#  define DDRA_BIT0 0x01
#define DDRB  0x0003
#  define DDRB_BIT7 0x80
#  define DDRB_BIT6 0x40
#  define DDRB_BIT5 0x20
#  define DDRB_BIT4 0x10
#  define DDRB_BIT3 0x08
#  define DDRB_BIT2 0x04
#  define DDRB_BIT1 0x02
#  define DDRB_BIT0 0x01
/* #define RESERVED_0x0004 0x0004 */
/* #define RESERVED_0x0005 0x0005 */
/* #define RESERVED_0x0006 0x0006 */
/* #define RESERVED_0x0007 0x0007 */
#define PORTE 0x0008
#  define PORTE_BIT7 0x80
#  define PORTE_BIT6 0x40
#  define PORTE_BIT5 0x20
#  define PORTE_BIT4 0x10
#  define PORTE_BIT3 0x08
#  define PORTE_BIT2 0x04
#  define PORTE_BIT1 0x02
#  define PORTE_BIT0 0x01
#define DDRE  0x0009
#  define DDRE_BIT7 0x80
#  define DDRE_BIT6 0x40
#  define DDRE_BIT5 0x20
#  define DDRE_BIT4 0x10
#  define DDRE_BIT3 0x08
#  define DDRE_BIT2 0x04
#  define DDRE_BIT1 0x02
#  define DDRE_BIT0 0x01
#define PEAR  0x000a
#  define PEAR_NOACCE 0x80
   /* #  define PEAR_ 0x40 */
#  define PEAR_PIP0E 0x20
#  define PEAR_NECLK 0x10
#  define PEAR_LSTRE 0x08
#  define PEAR_RDWE 0x04
   /* #  define PEAR_ 0x02 */
   /* #  define PEAR_ 0x01 */
#define MODE  0x000b
#  define MODE_MODC 0x80
#  define MODE_MODB 0x40
#  define MODE_MODA 0x20
   /* #  define MODE_ 0x10 */
#  define MODE_IVIS 0x08
   /* #  define MODE_ 0x04 */
#  define MODE_EMK 0x02
#  define MODE_EME 0x01
#define PUCR  0x000c
#  define PUCR_PUPKE 0x80
   /* #  define PUCR_ 0x40 */
   /* #  define PUCR_ 0x20 */
#  define PUCR_PUPEE 0x10
   /* #  define PUCR_ 0x08 */
   /* #  define PUCR_ 0x04 */
#  define PUCR_PUPBE 0x02
#  define PUCR_PUPAE 0x01
#define RDRIV 0x000d
#  define RDRIV_RDPK 0x80
   /* #  define RDRIV_ 0x40 */
   /* #  define RDRIV_ 0x20 */
#  define RDRIV_RDPE 0x10
   /* #  define RDRIV_ 0x08 */
   /* #  define RDRIV_ 0x04 */
#  define RDRIV_RDPB 0x02
#  define RDRIV_DRPA 0x01
#define EBICTL 0x00e
   /* #  define EBICTL_ 0x80 */
   /* #  define EBICTL_ 0x40 */
   /* #  define EBICTL_ 0x20 */
   /* #  define EBICTL_ 0x10 */
   /* #  define EBICTL_ 0x08 */
   /* #  define EBICTL_ 0x04 */
   /* #  define EBICTL_ 0x02 */
#  define EBICTL_ESTR 0x01
/* #define RESERVED_0x000f 0x000f */

/* MMC map 1 of 4 */

#define INITRM 0x0010
#  define INITRM_RAM15 0x80
#  define INITRM_RAM14 0x40
#  define INITRM_RAM13 0x20
#  define INITRM_RAM12 0x10
#  define INITRM_RAM11 0x08
   /* #  define INITRM_ 0x04 */
   /* #  define INITRM_ 0x02 */
#  define INITRM_RAMHAL 0x01
#define INITRG 0x0011
   /* #  define INITRG_ 0x80 */
#  define INITRG_REG14 0x40
#  define INITRG_REG13 0x20
#  define INITRG_REG12 0x10
#  define INITRG_REG11 0x08
   /* #  define INITRG_ 0x04 */
   /* #  define INITRG_ 0x02 */
   /* #  define INITRG_ 0x01 */
#define INITEE 0x0012
#  define INITEE_EE15 0x80
#  define INITEE_EE14 0x40
#  define INITEE_EE13 0x20
#  define INITEE_EE12 0x10
#  define INITEE_EE11 0x08
   /* #  define INITEE_ 0x04 */
   /* #  define INITEE_ 0x02 */
#  define INITEE_EEON 0x01
#define MISC 0x0013
   /* #  define MISC_ 0x80 */
   /* #  define MISC_ 0x40 */
   /* #  define MISC_ 0x20 */
   /* #  define MISC_ 0x10 */
#  define MISC_EXSTR1 0x08
#  define MISC_EXSTR0 0x04
#  define MISC_ROMHM 0x02
#  define MISC_ROMON 0x01
/* #define RESERVED_0x0014 0x0014 */

/* INT map 1 of 2 */

#define ITCR 0x0015
   /* #  define ITCR_ 0x80 */
   /* #  define ITCR_ 0x40 */
   /* #  define ITCR_ 0x20 */
#  define ITCR_WRINT 0x10
#  define ITCR_ADR3 0x08
#  define ITCR_ADR2 0x04
#  define ITCR_ADR1 0x02
#  define ITCR_ADR0 0x01
#define ITEST 0x0016
#  define ITEST_INTE 0x80
#  define ITEST_INTC 0x40
#  define ITEST_INTA 0x20
#  define ITEST_INT8 0x10
#  define ITEST_INT6 0x08
#  define ITEST_INT4 0x04
#  define ITEST_INT2 0x02
#  define ITEST_INT0 0x01

/* reserved 0x0017..0x0019 */

/* device id register */

#define PARTIDH 0x001a
#  define PARTIDH_ID15 0x80
#  define PARTIDH_ID14 0x40
#  define PARTIDH_ID13 0x20
#  define PARTIDH_ID12 0x10
#  define PARTIDH_ID11 0x08
#  define PARTIDH_ID10 0x04
#  define PARTIDH_ID9 0x02
#  define PARTIDH_ID8 0x01
#define PARTIDL 0x001b
#  define PARTIDL_ID7 0x80
#  define PARTIDL_ID6 0x40
#  define PARTIDL_ID5 0x20
#  define PARTIDL_ID4 0x10
#  define PARTIDL_ID3 0x08
#  define PARTIDL_ID2 0x04
#  define PARTIDL_ID1 0x02
#  define PARTIDL_ID0 0x01

/* MMC map 3 of 4 */

#define MEMSIZ0 0x001c
#  define MEMSIZ0_REG_SW0 0x80
   /* #  define MEMSIZ0_ 0x40 */
#  define MEMSIZ0_EEP_SW1 0x20
#  define MEMSIZ0_EEP_SW0 0x10
   /* #  define MEMSIZ0_ 0x08 */
#  define MEMSIZ0_RAM_SW2 0x04
#  define MEMSIZ0_RAM_SW1 0x02
#  define MEMSIZ0_RAM_SW0 0x01
#define MEMSIZ1 0x001d
#  define MEMSIZ1_ROM_SW1 0x80
#  define MEMSIZ1_ROM_SW0 0x40
   /* #  define MEMSIZ1_ 0x20 */
   /* #  define MEMSIZ1_ 0x10 */
   /* #  define MEMSIZ1_ 0x08 */
   /* #  define MEMSIZ1_ 0x04 */
#  define MEMSIZ1_PAG_SW1 0x02
#  define MEMSIZ1_PAG_SW0 0x01

/* MEBI map 2 of 3 */

#define INTCR 0x001e
#  define INTCR_IRQE 0x80
#  define INTCR_IRQEN 0x40
   /* #  define INTCR_ 0x20 */
   /* #  define INTCR_ 0x10 */
   /* #  define INTCR_ 0x08 */
   /* #  define INTCR_ 0x04 */
   /* #  define INTCR_ 0x02 */
   /* #  define INTCR_ 0x01 */

