george-hopkins/hcs12mem/target/io_mc9s12.h
/* INT map 2 of 2 */

#define HPRIO  0x001f
#  define HPRIO_PSEL7 0x80
#  define HPRIO_PSEL6 0x40
#  define HPRIO_PSEL5 0x20
#  define HPRIO_PSEL4 0x10
#  define HPRIO_PSEL3 0x08
#  define HPRIO_PSEL2 0x04
#  define HPRIO_PSEL1 0x02
   /* #  define HPRIO_ 0x01 */

/* MMC map 4 of 4 */

#define PPAGE 0x0030
   /* #  define PPAGE_ 0x80 */
   /* #  define PPAGE_ 0x40 */
#  define PPAGE_PIX5 0x20
#  define PPAGE_PIX4 0x10
#  define PPAGE_PIX3 0x08
#  define PPAGE_PIX2 0x04
#  define PPAGE_PIX1 0x02
#  define PPAGE_PIX0 0x01
/* #define RESERVED_0x0031 0x0031 */

/* MEBI map 3 of 3 */

#define PORTK 0x0032
#  define PORTK_BIT7 0x80
#  define PORTK_BIT6 0x40
#  define PORTK_BIT5 0x20
#  define PORTK_BIT4 0x10
#  define PORTK_BIT3 0x08
#  define PORTK_BIT2 0x04
#  define PORTK_BIT1 0x02
#  define PORTK_BIT0 0x01
#define DDRK  0x0033
#  define DDRK_BIT7 0x80
#  define DDRK_BIT6 0x40
#  define DDRK_BIT5 0x20
#  define DDRK_BIT4 0x10
#  define DDRK_BIT3 0x08
#  define DDRK_BIT2 0x04
#  define DDRK_BIT1 0x02
#  define DDRK_BIT0 0x01
#define SYNR  0x0034
   /* #  define SYNR_ 0x80 */
   /* #  define SYNR_ 0x40 */
#  define SYNR_SYN5 0x20
#  define SYNR_SYN4 0x10
#  define SYNR_SYN3 0x08
#  define SYNR_SYN2 0x04
#  define SYNR_SYN1 0x02
#  define SYNR_SYN0 0x01
#define REFDV 0x0035
   /* #  define REFDV_ 0x80 */
   /* #  define REFDV_ 0x40 */
   /* #  define REFDV_ 0x20 */
   /* #  define REFDV_ 0x10 */
#  define REFDV_REFDV3 0x08
#  define REFDV_REFDV2 0x04
#  define REFDV_REFDV1 0x02
#  define REFDV_REFDV0 0x01
#define CTFLG 0x0036 /* test only */
#define CRGFLG 0x0037
#  define CRGFLG_RTIF 0x80
#  define CRGFLG_PORF 0x40
   /* #  define CRGFLG_ 0x20 */
#  define CRGFLG_LOCKIF 0x10
#  define CRGFLG_LOCK 0x08
#  define CRGFLG_TRACK 0x04
#  define CRGFLG_SCMIF 0x02
#  define CRGFLG_SCM 0x01
#define CRGINT 0x0038
#  define CRGINT_RTIE 0x80
   /* #  define CRGINT_ 0x40 */
   /* #  define CRGINT_ 0x20 */
#  define CRGINT_LOCKIE 0x10
   /* #  define CRGINT_ 0x08 */
   /* #  define CRGINT_ 0x04 */
#  define CRGINT_SCMIE 0x02
   /* #  define CRGINT_ 0x01 */
#define CLKSEL 0x0039
#  define CLKSEL_PLLSEL 0x80
#  define CLKSEL_PSTP 0x40
#  define CLKSEL_SYSWAI 0x20
#  define CLKSEL_ROAWAI 0x10
#  define CLKSEL_PLLWAI 0x08
#  define CLKSEL_CWAI 0x04
#  define CLKSEL_RTIWAI 0x02
#  define CLKSEL_COPWAI 0x01
#define PLLCTL 0x003a
#  define PLLCTL_CME 0x80
#  define PLLCTL_PLLON 0x40
#  define PLLCTL_AUTO 0x20
#  define PLLCTL_ACQ 0x10
   /* #  define PLLCTL_ 0x08 */
#  define PLLCTL_PRE 0x04
#  define PLLCTL_PCE 0x02
#  define PLLCTL_SCME 0x01
#define RTICTL 0x003b
   /* #  define RTICTL_ 0x80 */
#  define RTICTL_RTR6 0x40
#  define RTICTL_RTR5 0x20
#  define RTICTL_RTR4 0x10
#  define RTICTL_RTR3 0x08
#  define RTICTL_RTR2 0x04
#  define RTICTL_RTR1 0x02
#  define RTICTL_RTR0 0x01
#define COPCTL 0x003c
#  define COPCTL_WCOP 0x80
#  define COPCTL_RSBCK 0x40
   /* #  define COPCTL_ 0x20 */
   /* #  define COPCTL_ 0x10 */
   /* #  define COPCTL_ 0x08 */
#  define COPCTL_CR2 0x04
#  define COPCTL_CR1 0x02
#  define COPCTL_CR0 0x01
#define FORBYP 0x003d /* test only */
#define CTCTL  0x003e /* test only */
#define ARMCOP 0x003f

/* SCI0 */

#define SCI0BD  0x00c8
#define SCI0BDH 0x00c8
   /* #  define SCI0BDH_ 0x80 */
   /* #  define SCI0BDH_ 0x40 */
   /* #  define SCI0BDH_ 0x20 */
#  define SCI0BDH_SBR12 0x10
#  define SCI0BDH_SBR11 0x08
#  define SCI0BDH_SBR10 0x04
#  define SCI0BDH_SBR9 0x02
#  define SCI0BDH_SBR8 0x01
#define SCI0BDL 0x00c9
#  define SCI0BDL_SBR7 0x80
#  define SCI0BDL_SBR6 0x40
#  define SCI0BDL_SBR5 0x20
#  define SCI0BDL_SBR4 0x10
#  define SCI0BDL_SBR3 0x08
#  define SCI0BDL_SBR2 0x04
#  define SCI0BDL_SBR1 0x02
#  define SCI0BDL_SBR0 0x01
#define SCI0CR1 0x00ca
#  define SCI0CR1_LOOPS 0x80
#  define SCI0CR1_SCISWAI 0x40
#  define SCI0CR1_RSRC 0x20
#  define SCI0CR1_M 0x10
#  define SCI0CR1_WAKE 0x08
#  define SCI0CR1_ILT 0x04
#  define SCI0CR1_PE 0x02
#  define SCI0CR1_PT 0x01
#define SCI0CR2 0x00cb
#  define SCI0CR2_TIE 0x80
#  define SCI0CR2_TCIE 0x40
#  define SCI0CR2_RIE 0x20
#  define SCI0CR2_ILIE 0x10
#  define SCI0CR2_TE 0x08
#  define SCI0CR2_RE 0x04
#  define SCI0CR2_RWU 0x02
#  define SCI0CR2_SBK 0x01
#define SCI0SR1 0x00cc
#  define SCI0SR1_TDRE 0x80
#  define SCI0SR1_TC 0x40
#  define SCI0SR1_RDRF 0x20
#  define SCI0SR1_IDLE 0x10
#  define SCI0SR1_OR 0x08
#  define SCI0SR1_NF 0x04
#  define SCI0SR1_FE 0x02
#  define SCI0SR1_PF 0x01
#define SCI0SR2 0x00cd
   /* #  define SCI0SR2_ 0x80 */
   /* #  define SCI0SR2_ 0x40 */
   /* #  define SCI0SR2_ 0x20 */
   /* #  define SCI0SR2_ 0x10 */
   /* #  define SCI0SR2_ 0x08 */
#  define SCI0SR2_BRK13 0x04
#  define SCI0SR2_TXDIR 0x02
#  define SCI0SR2_RAF 0x01
#define SCI0DRH 0x00ce
#  define SCI0DRH_R8 0x80
#  define SCI0DRH_T8 0x40
   /* #  define SCI0DRH_ 0x20 */
   /* #  define SCI0DRH_ 0x10 */
   /* #  define SCI0DRH_ 0x08 */
   /* #  define SCI0DRH_ 0x04 */
   /* #  define SCI0DRH_ 0x02 */
   /* #  define SCI0DRH_ 0x01 */
#define SCI0DRL 0x00cf
#  define SCI0DRL_R7_T7 0x80
#  define SCI0DRL_R6_T6 0x40
#  define SCI0DRL_R5_T5 0x20
#  define SCI0DRL_R4_T4 0x10
#  define SCI0DRL_R3_T3 0x08
#  define SCI0DRL_R2_T2 0x04
#  define SCI0DRL_R1_T1 0x02
#  define SCI0DRL_R0_T0 0x01

/* SCI1 */

#define SCI1BD  0x00d0
#define SCI1BDH 0x00d0
   /* #  define SCI1BDH_ 0x80 */
   /* #  define SCI1BDH_ 0x40 */
   /* #  define SCI1BDH_ 0x20 */
#  define SCI1BDH_SBR12 0x10
#  define SCI1BDH_SBR11 0x08
#  define SCI1BDH_SBR10 0x04
#  define SCI1BDH_SBR9 0x02
#  define SCI1BDH_SBR8 0x01
#define SCI1BDL 0x00d1
#  define SCI1BDL_SBR7 0x80
#  define SCI1BDL_SBR6 0x40
#  define SCI1BDL_SBR5 0x20
#  define SCI1BDL_SBR4 0x10
#  define SCI1BDL_SBR3 0x08
#  define SCI1BDL_SBR2 0x04
#  define SCI1BDL_SBR1 0x02
#  define SCI1BDL_SBR0 0x01
#define SCI1CR1 0x00d2
#  define SCI1CR1_LOOPS 0x80
#  define SCI1CR1_SCISWAI 0x40
#  define SCI1CR1_RSRC 0x20
#  define SCI1CR1_M 0x10
#  define SCI1CR1_WAKE 0x08
#  define SCI1CR1_ILT 0x04
#  define SCI1CR1_PE 0x02
#  define SCI1CR1_PT 0x01
#define SCI1CR2 0x00d3
#  define SCI1CR2_TIE 0x80
#  define SCI1CR2_TCIE 0x40
#  define SCI1CR2_RIE 0x20
#  define SCI1CR2_ILIE 0x10
#  define SCI1CR2_TE 0x08
#  define SCI1CR2_RE 0x04
#  define SCI1CR2_RWU 0x02
#  define SCI1CR2_SBK 0x01
#define SCI1SR1 0x00d4
#  define SCI1SR1_TDRE 0x80
#  define SCI1SR1_TC 0x40
#  define SCI1SR1_RDRF 0x20
#  define SCI1SR1_IDLE 0x10
#  define SCI1SR1_OR 0x08
#  define SCI1SR1_NF 0x04
#  define SCI1SR1_FE 0x02
#  define SCI1SR1_PF 0x01
#define SCI1SR2 0x00d5
   /* #  define SCI1SR2_ 0x80 */
   /* #  define SCI1SR2_ 0x40 */
   /* #  define SCI1SR2_ 0x20 */
   /* #  define SCI1SR2_ 0x10 */
   /* #  define SCI1SR2_ 0x08 */
#  define SCI1SR2_BRK13 0x04
#  define SCI1SR2_TXDIR 0x02
#  define SCI1SR2_RAF 0x01
#define SCI1DRH 0x00d6
#  define SCI1DRH_R8 0x80
#  define SCI1DRH_T8 0x40
   /* #  define SCI1DRH_ 0x20 */
   /* #  define SCI1DRH_ 0x10 */
   /* #  define SCI1DRH_ 0x08 */
   /* #  define SCI1DRH_ 0x04 */
   /* #  define SCI1DRH_ 0x02 */
   /* #  define SCI1DRH_ 0x01 */
#define SCI1DRL 0x00d7
#  define SCI1DRL_R7_T7 0x80
#  define SCI1DRL_R6_T6 0x40
#  define SCI1DRL_R5_T5 0x20
#  define SCI1DRL_R4_T4 0x10
#  define SCI1DRL_R3_T3 0x08
#  define SCI1DRL_R2_T2 0x04
#  define SCI1DRL_R1_T1 0x02
#  define SCI1DRL_R0_T0 0x01

